photonthunder/RA4M3_Zephyr/misc/ek_ra4w1_ek_ra6m3/zephyr/samples/bluetooth/ble_ek_ra4w1/qe_gen/ble/profile_cmn/r_ble_servs_if.c
        case BLE_GATTS_OP_CHAR_PEER_WRITE_CMD:
        {
            if (NULL != p_char->decode)
            {
                ble_status_t ret;
                void *p_app_value;

                p_app_value = malloc(p_char->app_size);
                ret = p_char->decode(p_app_value, p_value);

                if (NULL != p_char->write_cmd_cb)
                {
                    p_char->write_cmd_cb(p_char, conn_hdl, ret, &p_app_value);
                }
                else
                {
                    st_ble_servs_evt_data_t evt_data = {
                        .conn_hdl  = conn_hdl,
                        .param_len = p_char->app_size,
                        .p_param   = p_app_value,
                    };
                    p_serv->cb(BLE_SERVS_MULTI_ATTR_EVENT(p_char->char_idx, p_char->inst_idx, BLE_SERVS_WRITE_CMD), ret, &evt_data);
                }

                free(p_app_value);
            }
        } break;

        case BLE_GATTS_OP_CHAR_PEER_CLI_CNFG_WRITE_REQ:
        case BLE_GATTS_OP_CHAR_PEER_SER_CNFG_WRITE_REQ:
        case BLE_GATTS_OP_CHAR_PEER_USR_DESC_WRITE_REQ:
        case BLE_GATTS_OP_CHAR_PEER_HLD_DESC_WRITE_REQ:
        {
            desc_write_evt_handler(conn_hdl, attr_hdl, p_value);
        } break;

        case BLE_GATTS_OP_CHAR_PEER_CLI_CNFG_READ_REQ:
        case BLE_GATTS_OP_CHAR_PEER_SER_CNFG_READ_REQ:
        case BLE_GATTS_OP_CHAR_PEER_USR_DESC_READ_REQ:
        case BLE_GATTS_OP_CHAR_PEER_HLD_DESC_READ_REQ:
        {
            desc_read_evt_handler(conn_hdl, attr_hdl);
        } break;

        case BLE_GATTS_OP_CHAR_REQ_AUTHOR:
        {
        } break;

        default:
        {
            /* Do nothing. */
        } break;
    }
}

void R_BLE_SERVS_GattsCb(uint16_t type, ble_status_t result, st_ble_gatts_evt_data_t *p_data)
{
    static uint16_t s_write_long_attr_hdl = BLE_GATT_INVALID_ATTR_HDL_VAL;
    
    switch (type)
    {
        case BLE_GATTS_EVENT_CONN_IND:
        case BLE_GATTS_EVENT_DISCONN_IND:
        break;

        case BLE_GATTS_EVENT_EX_MTU_REQ:
        {
            R_BLE_GATTS_RspExMtu(p_data->conn_hdl, BLE_PRF_MTU_SIZE);
        } 
        break;

        case BLE_GATTS_EVENT_HDL_VAL_CNF:
        {
            const st_ble_gatts_cfm_evt_t *p_cfm_evt_param =
                (st_ble_gatts_cfm_evt_t *)p_data->p_param;

            const st_ble_servs_info_t       *p_serv = NULL;
            const st_ble_servs_char_info_t  *p_char = NULL;

            find_attr(p_cfm_evt_param->attr_hdl, &p_serv, &p_char);

            if ((NULL != p_serv) && (NULL != p_char))
            {
                if ((p_char->start_hdl + 1) == p_cfm_evt_param->attr_hdl)
                {
                    if (NULL != p_char->hdl_val_cnf_cb)
                    {
                        p_char->hdl_val_cnf_cb(p_char, p_data->conn_hdl);
                    }
                    else
                    {
                        st_ble_servs_evt_data_t evt_data = {
                            .conn_hdl  = p_data->conn_hdl,
                            .param_len = 0,
                            .p_param   = NULL,
                        };
                        p_serv->cb(BLE_SERVS_MULTI_ATTR_EVENT(p_char->char_idx, p_char->inst_idx, BLE_SERVS_HDL_VAL_CNF), BLE_SUCCESS, &evt_data);
                    }
                }
            }
        } break;

        case BLE_GATTS_EVENT_DB_ACCESS_IND:
        {
            const st_ble_gatts_db_access_evt_t *p_db_access_evt_param =
                (st_ble_gatts_db_access_evt_t *)p_data->p_param;

            ble_gatts_db_app_cb(p_data->conn_hdl,
                                p_db_access_evt_param->p_params->db_op,
                                p_db_access_evt_param->p_params->attr_hdl,
                                &p_db_access_evt_param->p_params->value);
        } break;

        case BLE_GATTS_EVENT_WRITE_RSP_COMP:
        {
            st_ble_gatts_write_rsp_evt_t *p_write_rsp_evt_param =
                (st_ble_gatts_write_rsp_evt_t *)p_data->p_param;

            const st_ble_servs_info_t       *p_serv = NULL;
            const st_ble_servs_char_info_t  *p_char = NULL;

            find_attr(p_write_rsp_evt_param->attr_hdl, &p_serv, &p_char);

            if ((NULL != p_serv) && (NULL != p_char))
            {
                /* Characteristic */
                if (((p_char->start_hdl + 1) == p_write_rsp_evt_param->attr_hdl) && (NULL != p_char->decode))
                {
                    ble_status_t ret;

                    void *p_app_value;
                    p_app_value = malloc(p_char->app_size);

                    ret = R_BLE_SERVS_GetChar(p_char, p_data->conn_hdl, p_app_value);

                    if (NULL != p_char->write_comp_cb)
                    {
                        p_char->write_comp_cb(p_char, p_data->conn_hdl, result, p_app_value);
                    }
                    else
                    {
                        st_ble_servs_evt_data_t evt_data = {
                            .conn_hdl  = p_data->conn_hdl,
                            .param_len = p_char->app_size,
                            .p_param   = p_app_value,
                        };
                        p_serv->cb(BLE_SERVS_MULTI_ATTR_EVENT(p_char->char_idx, p_char->inst_idx, BLE_SERVS_WRITE_COMP), ret, &evt_data);
                    }

                    free(p_app_value);
                }
                /* Descriptor */
                else
                {
                    if (NULL != p_char->pp_descs)
                    {
                        for (uint8_t d = 0; d < p_char->num_of_descs; d++)
                        {
                            if ((p_char->pp_descs[d]->attr_hdl == p_write_rsp_evt_param->attr_hdl) &&
                                (NULL != p_char->pp_descs[d]->decode))
                            {
                                ble_status_t ret;

                                void *p_app_value;
                                p_app_value = malloc(p_char->pp_descs[d]->app_size);

