photonthunder/RA4M3_Zephyr/misc/ek_ra4w1_ek_ra6m3/zephyr/samples/bluetooth/ble_ek_ra4w1/qe_gen/ble/profile_cmn/r_ble_servs_if.c
void R_BLE_SERVS_VsCb(uint16_t type, ble_status_t result, st_ble_vs_evt_data_t * p_data)
{
    /* unused arg */
    (void)result;

    switch (type)
    {
        case BLE_VS_EVENT_TX_FLOW_STATE_CHG:
        {
            st_ble_vs_tx_flow_chg_evt_t *p_tx_flow_chg_param =
                (st_ble_vs_tx_flow_chg_evt_t *)p_data->p_param;

            uint32_t buffer_num;
            R_BLE_VS_GetTxBufferNum(&buffer_num);

            if (BLE_VS_TX_FLOW_CTL_ON == p_tx_flow_chg_param->state)
            {
                for (uint8_t s = 0; s < gs_num_of_servs; s++)
                {
                    for (uint8_t c = 0; c < gs_servs[s]->num_of_chars; c++)
                    {
                        if (NULL != gs_servs[s]->pp_chars[c]->flow_ctrl_cb)
                        {
                            gs_servs[s]->pp_chars[c]->flow_ctrl_cb(gs_servs[s]->pp_chars[c]);
                        }
                    }
                }
            }
        } break;

        default:
        {
            /* Do nothing */
        } break;
    }
}

ble_status_t R_BLE_SERVS_Init(void)
{
    R_BLE_VS_StartTxFlowEvtNtf();
    gs_num_of_servs = 0;

    return BLE_SUCCESS;
}

ble_status_t R_BLE_SERVS_RegisterServer(const st_ble_servs_info_t *p_info)
{
    ble_status_t ret;
    if( BLE_PRF_MAX_NUM_OF_SERVS > gs_num_of_servs )
    {
        gs_servs[gs_num_of_servs++] = p_info;
        ret = BLE_SUCCESS;
    }
    else
    {
        ret = BLE_ERR_CONTEXT_FULL;
    }

    return ret;
}

ble_status_t R_BLE_SERVS_SendHdlVal(const st_ble_servs_char_info_t *p_attr, uint16_t conn_hdl,  const void *p_app_value, bool is_notify)
{
    ble_status_t ret;

    if ((NULL == p_attr) || (NULL == p_attr->encode) || (NULL == p_attr->pp_descs))
    {
        return BLE_ERR_INVALID_PTR;
    }

    if (NULL == p_app_value)
    {
        return BLE_ERR_INVALID_ARG;
    }

    if (BLE_GAP_INVALID_CONN_HDL == conn_hdl)
    {
        return BLE_ERR_INVALID_HDL;
    }

    /* Check CCCD */
    uint16_t cccd = 0;
    R_BLE_SERVS_GetDesc(p_attr->pp_descs[0], conn_hdl, &cccd);

    void *p_gatt_value = malloc(p_attr->db_size);

    if (NULL == p_gatt_value)
    {
        return BLE_ERR_MEM_ALLOC_FAILED;
    }

    st_ble_gatt_hdl_value_pair_t hdl_val_data = {
        .attr_hdl        = (uint16_t)(p_attr->start_hdl + 1),
        .value.value_len = p_attr->db_size,
        .value.p_value   = (uint8_t *)p_gatt_value,
    };

    ret = p_attr->encode(p_app_value, &hdl_val_data.value);

    if (BLE_SUCCESS == ret)
    {
        if ((is_notify == true) && (cccd & BLE_GATTS_CLI_CNFG_NOTIFICATION))
        {
            ret = R_BLE_GATTS_Notification(conn_hdl, &hdl_val_data);
        }
        else if ((is_notify == false) && (cccd & BLE_GATTS_CLI_CNFG_INDICATION))
        {
            ret = R_BLE_GATTS_Indication(conn_hdl, &hdl_val_data);
        }
        else 
        {
            ret = BLE_ERR_INVALID_OPERATION;
        }
    }

    free(p_gatt_value);

    return ret;
}

ble_status_t R_BLE_SERVS_GetChar(const st_ble_servs_char_info_t *p_attr, uint16_t conn_hdl, void *p_app_value)
{
    ble_status_t ret;

    if (NULL == p_app_value)
    {
        return BLE_ERR_INVALID_ARG;
    }

    if ((NULL == p_attr) || (NULL == p_attr->decode))
    {
        return BLE_ERR_INVALID_PTR;
    }

    st_ble_gatt_value_t gatt_value;

    ret = R_BLE_GATTS_GetAttr(conn_hdl, (uint16_t)(p_attr->start_hdl + 1), &gatt_value);

    if (BLE_SUCCESS == ret)
    {
        ret = p_attr->decode(p_app_value, &gatt_value);
    }

    return ret;
}

ble_status_t R_BLE_SERVS_SetChar(const st_ble_servs_char_info_t *p_attr, uint16_t conn_hdl, const void *p_app_value)
{
    ble_status_t ret;

    if (NULL == p_app_value)
    {
        return BLE_ERR_INVALID_ARG;
    }

    if ((NULL == p_attr) || (NULL == p_attr->encode))
    {
        return BLE_ERR_INVALID_PTR;
    }

    void *p_gatt_value = malloc(p_attr->db_size);

    if (NULL == p_gatt_value)
    {
        return BLE_ERR_MEM_ALLOC_FAILED;
    }

    st_ble_gatt_value_t gatt_value = {
        .p_value   = p_gatt_value,
        .value_len = p_attr->db_size,
    };

    ret = p_attr->encode(p_app_value, &gatt_value);

    if (BLE_SUCCESS == ret)
    {
        ret = R_BLE_GATTS_SetAttr(conn_hdl, (uint16_t)(p_attr->start_hdl + 1), &gatt_value);
    }

    free(p_gatt_value);

    return ret;
}

ble_status_t R_BLE_SERVS_GetDesc(const st_ble_servs_desc_info_t *p_attr, uint16_t conn_hdl, void *p_app_value)
{
    ble_status_t ret;

    if (NULL == p_app_value)
    {
        return BLE_ERR_INVALID_ARG;
    }

    if ((NULL == p_attr) || (NULL == p_attr->decode))
    {
        return BLE_ERR_INVALID_PTR;
    }

    st_ble_gatt_value_t gatt_value;

    ret = R_BLE_GATTS_GetAttr(conn_hdl, p_attr->attr_hdl, &gatt_value);

    if (BLE_SUCCESS == ret)
    {
        ret = p_attr->decode(p_app_value, &gatt_value);
    }

    return ret;
}

ble_status_t R_BLE_SERVS_SetDesc(const st_ble_servs_desc_info_t *p_attr, uint16_t conn_hdl, const void *p_app_value)
{
    ble_status_t ret;

    if (NULL == p_app_value)
    {
        return BLE_ERR_INVALID_ARG;
    }

    if ((NULL == p_attr) || (NULL == p_attr->encode))
    {
        return BLE_ERR_INVALID_PTR;
    }

    void *p_gatt_value = malloc(p_attr->db_size);

    if (NULL == p_gatt_value)
    {
        return BLE_ERR_MEM_ALLOC_FAILED;
    }

    st_ble_gatt_value_t gatt_value = {
        .p_value   = p_gatt_value,
        .value_len = p_attr->db_size,
    };

    ret = p_attr->encode(p_app_value, &gatt_value);

    if (BLE_SUCCESS == ret)
    {
        ret = R_BLE_GATTS_SetAttr(conn_hdl, p_attr->attr_hdl, &gatt_value);
    }

    free(p_gatt_value);

    return ret;
}
